org-publish-settings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-20 Tue 02:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Site Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Josh Berry" />
</head>
<body>
<div id="content">
<h1 class="title">My Site Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8aa3f3">1. What is this?</a></li>
<li><a href="#org317d23e">2. Org Settings</a></li>
<li><a href="#orgbf3938b">3. Styling</a>
<ul>
<li><a href="#orgbbae334">3.1. CSS Overrides</a></li>
<li><a href="#org09ab945">3.2. <span class="todo TODO">TODO</span> Headers/Footers/etc</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8aa3f3" class="outline-2">
<h2 id="orgd8aa3f3"><span class="section-number-2">1</span> What is this?</h2>
<div class="outline-text-2" id="text-1">
<p>
If you are reading this, I can only assume that is because you are
me, and you are trying to change something about this site.  As
such, hopefully most of this is all straight forward and still
relevant.
</p>
</div>
</div>

<div id="outline-container-org317d23e" class="outline-2">
<h2 id="org317d23e"><span class="section-number-2">2</span> Org Settings</h2>
<div class="outline-text-2" id="text-2">
<p>
For this website, we are not doing anything too fancy.  Just giving
it a name
</p>

<div class="org-src-container">
<pre class="src src-elisp">(setq org-publish-project-alist
      '(("site"
         :base-directory "."
         :publishing-directory "."
         :base-extension "org"
         :publishing-function org-html-publish-to-html)))
</pre>
</div>


<p>
With that set, you can simply call <a href="(org-publish-current-project)">(org-publish-current-project)</a>
</p>
</div>
</div>

<div id="outline-container-orgbf3938b" class="outline-2">
<h2 id="orgbf3938b"><span class="section-number-2">3</span> Styling</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbbae334" class="outline-3">
<h3 id="orgbbae334"><span class="section-number-3">3.1</span> CSS Overrides</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Luckily, I don't actually have to do that much to get the site
looking decently.  Actually, about the only thing I do is to limit
the width to be about 50em.  I came to that number through some
basic trial and error for what I thought looked decent.
</p>

<p>
I also play with some of the alignments and hide the table of
contents.
</p>

<div class="org-src-container">
<pre class="src src-css">html {
  background: #020;
}
body {
  max-width: 50em;
  padding-left: 3em;
  padding-right: 3em;
  margin: auto;
  border: solid thin black;
  background-color: #DDD;
}

h1.title {
  text-align: left;
  padding: 1ex;
}

h1, h2, h3, h4 {
  margin-bottom: 1ex;
}

p {
  margin-top: 0;
}

div.outline-text-2, div.outline-text-3, div.outline-text-4 {
  padding: 1em;
  padding-top: 0;
}
.org-src-container {
  max-width: 40em;
  margin: auto;
}
.org-src-container .src {
  color: #EEE;
  background-color: #222;
  overflow: auto;
}
#table-of-contents {
  display: none;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org09ab945" class="outline-3">
<h3 id="org09ab945"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Headers/Footers/etc</h3>
<div class="outline-text-3" id="text-3-2">
<p>
I would like to get it so that headers and footers are all styled
in a pleasant way.  Right now, I'm not even sure how to do that
with org publishing, to be honest.
</p>

<p>
I also am not sure I will be sticking with this stuff.  I hope I
do&#x2026; but I don't know if I will.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2020-10-20 Tue 02:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
